storage/app/step83-load-results/20260518-000053/baseline_ai_daily_scores.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/ai/scores/daily
Document Length:        Variable

Concurrency Level:      20
Time taken for tests:   1.527 seconds
Complete requests:      200
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      102782 bytes
HTML transferred:       37000 bytes
Requests per second:    130.94 [#/sec] (mean)
Time per request:       152.740 [ms] (mean)
Time per request:       7.637 [ms] (mean, across all concurrent requests)
Transfer rate:          65.71 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       6
Processing:    23  144  26.2    148     185
Waiting:       22  144  26.2    148     185
Total:         23  144  26.1    148     185

Percentage of the requests served within a certain time (ms)
  50%    148
  66%    153
  75%    157
  80%    160
  90%    171
  95%    177
  98%    181
  99%    183
 100%    185 (longest request)