storage/app/step83-load-results/20260518-000053/baseline_finance_transactions.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Finished 200 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/finance/transactions
Document Length:        Variable

Concurrency Level:      20
Time taken for tests:   1.172 seconds
Complete requests:      200
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      81806 bytes
HTML transferred:       16000 bytes
Requests per second:    170.71 [#/sec] (mean)
Time per request:       117.156 [ms] (mean)
Time per request:       5.858 [ms] (mean, across all concurrent requests)
Transfer rate:          68.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0  196  95.9    195     402
Waiting:        0  195  95.8    195     402
Total:          0  196  95.9    195     402

Percentage of the requests served within a certain time (ms)
  50%    195
  66%    215
  75%    263
  80%    284
  90%    323
  95%    331
  98%    371
  99%    384
 100%    402 (longest request)