storage/app/step83-load-results/20260518-000053/smoke_ai_daily_scores.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/ai/scores/daily
Document Length:        Variable

Concurrency Level:      5
Time taken for tests:   0.563 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      25701 bytes
HTML transferred:       9250 bytes
Requests per second:    88.82 [#/sec] (mean)
Time per request:       56.292 [ms] (mean)
Time per request:       11.258 [ms] (mean, across all concurrent requests)
Transfer rate:          44.59 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:    22   53  15.8     52     101
Waiting:       22   53  15.9     52     101
Total:         22   53  15.8     52     101

Percentage of the requests served within a certain time (ms)
  50%     52
  66%     60
  75%     62
  80%     67
  90%     72
  95%     77
  98%    101
  99%    101
 100%    101 (longest request)