storage/app/step83-load-results/20260518-000053/smoke_finance_ai_insights.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/finance/ai-insights
Document Length:        Variable

Concurrency Level:      5
Time taken for tests:   0.523 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      45824 bytes
HTML transferred:       29350 bytes
Requests per second:    95.66 [#/sec] (mean)
Time per request:       52.269 [ms] (mean)
Time per request:       10.454 [ms] (mean, across all concurrent requests)
Transfer rate:          85.61 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    26   49  10.9     51      73
Waiting:       26   49  10.9     49      73
Total:         26   49  10.9     51      73

Percentage of the requests served within a certain time (ms)
  50%     51
  66%     55
  75%     57
  80%     59
  90%     63
  95%     65
  98%     73
  99%     73
 100%     73 (longest request)