storage/app/step83-load-results/20260518-000053/smoke_health_steps.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/health/steps
Document Length:        Variable

Concurrency Level:      5
Time taken for tests:   0.517 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      20094 bytes
HTML transferred:       3650 bytes
Requests per second:    96.68 [#/sec] (mean)
Time per request:       51.715 [ms] (mean)
Time per request:       10.343 [ms] (mean, across all concurrent requests)
Transfer rate:          37.94 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       2
Processing:    27   45  11.7     44      68
Waiting:       27   45  11.9     44      68
Total:         27   46  11.8     45      69

Percentage of the requests served within a certain time (ms)
  50%     45
  66%     50
  75%     51
  80%     57
  90%     64
  95%     68
  98%     69
  99%     69
 100%     69 (longest request)