storage/app/step83-load-results/20260518-000053/smoke_life_balance_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/life-balance/summary
Document Length:        Variable

Concurrency Level:      5
Time taken for tests:   0.898 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      48906 bytes
HTML transferred:       32450 bytes
Requests per second:    55.68 [#/sec] (mean)
Time per request:       89.802 [ms] (mean)
Time per request:       17.960 [ms] (mean, across all concurrent requests)
Transfer rate:          53.18 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.8      0       5
Processing:    38   73  26.5     68     186
Waiting:       37   72  26.8     67     185
Total:         38   73  26.5     68     186

Percentage of the requests served within a certain time (ms)
  50%     68
  66%     78
  75%     83
  80%     97
  90%    112
  95%    112
  98%    186
  99%    186
 100%    186 (longest request)