storage/app/step83-load-results/20260518-000053/smoke_productivity_tasks.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/productivity/tasks
Document Length:        Variable

Concurrency Level:      5
Time taken for tests:   0.477 seconds
Complete requests:      50
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      23497 bytes
HTML transferred:       7050 bytes
Requests per second:    104.88 [#/sec] (mean)
Time per request:       47.673 [ms] (mean)
Time per request:       9.535 [ms] (mean, across all concurrent requests)
Transfer rate:          48.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    23   45   8.0     46      69
Waiting:       23   45   8.0     45      68
Total:         23   45   8.0     46      69

Percentage of the requests served within a certain time (ms)
  50%     46
  66%     48
  75%     49
  80%     51
  90%     54
  95%     55
  98%     69
  99%     69
 100%     69 (longest request)