storage/app/step83-load-results/20260518-000053/stress_dashboard_summary.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/dashboard/summary
Document Length:        Variable

Concurrency Level:      50
Time taken for tests:   4.306 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      510465 bytes
HTML transferred:       346000 bytes
Requests per second:    116.11 [#/sec] (mean)
Time per request:       430.640 [ms] (mean)
Time per request:       8.613 [ms] (mean, across all concurrent requests)
Transfer rate:          115.76 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:    24  408 118.8    392     777
Waiting:       22  408 118.8    392     777
Total:         24  408 118.6    392     777

Percentage of the requests served within a certain time (ms)
  50%    392
  66%    410
  75%    423
  80%    436
  90%    575
  95%    665
  98%    725
  99%    758
 100%    777 (longest request)