storage/app/step83-load-results/20260518-000053/stress_health_ai_insights.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        nginx/1.27.5
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /api/v1/health/ai-insights
Document Length:        Variable

Concurrency Level:      50
Time taken for tests:   8.255 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      366946 bytes
HTML transferred:       202000 bytes
Requests per second:    60.57 [#/sec] (mean)
Time per request:       825.452 [ms] (mean)
Time per request:       16.509 [ms] (mean, across all concurrent requests)
Transfer rate:          43.41 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.7      0       6
Processing:    51  772 155.6    783    1056
Waiting:       48  772 155.6    782    1056
Total:         51  773 155.2    783    1056

Percentage of the requests served within a certain time (ms)
  50%    783
  66%    817
  75%    844
  80%    864
  90%    927
  95%    983
  98%   1033
  99%   1048
 100%   1056 (longest request)